app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Gym"], ["room_number", 1], ["created_at", "2017-10-17 00:08:18.451407"], ["updated_at", "2017-10-17 00:08:18.451407"]]
---
  def create
    @school_class = SchoolClass.new
    @school_class.title = params[:school_class][:title]
    @school_class.room_number = params[:school_class][:room_number]
    @school_class.save