app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "David"], ["last_name", "T"], ["created_at", "2017-10-16 21:49:10.626823"], ["updated_at", "2017-10-16 21:49:10.626823"]]
---
  def create
    @student = Student.new
    @student.first_name = params[:student][:first_name]
    @student.last_name = params[:student][:last_name]
    @student.save